{
  "_generated": "Generated by SweetTooth, do not edit", 
  "description": "Launch or focus the window or define custom shortcuts in a text file.\n\nRun-or-raise\n============\n\nAbout project\n=============\n\nI assume the run-or-raise style as the most efficient way of launching window. No more searching for your favourite program in a long menu, no more clicking on the icons. If the program already runs it'll get focus, else we launch it. Several years ago, OS creators finally realized that efficiency and let the users run-or-raise programs on the taskbar or dock by `&amp;amp;amp;lt;Super&amp;amp;amp;gt;+number` shortcuts. But what if you use more programs than nine? What if you don't want the unnecessary taskbar to occupy precious place on your screen?  \nWith the emergence of Wayland over X.org in Ubuntu 17.10, we can't reliably use good old `xbindkeys` and `jumpapp` to master shortcuts. Here is a gnome-shell extension that let you migrate your favourite shortcuts to `shortcuts.conf` file.\n\nConfiguration\n=============\n\nOn the first run, `shortcuts.conf` gets created from `shortcuts.default` if not exists. There you define your own shortcuts. The shortcuts may be defined in two ways:\n\n\n## Run or raise form\n\nThis form let you cycle between open instances of the application or if not found, launches a new instance.\n\n Run-or-raise form: `shortcut,command,[wm_class],[title]`\n   * wm_class and title are optional and case sensitive\n   * if none is set, lowercased launch-command is compared with lowercased windows wm_classes and titles\n\n### Examples:\n\n\nThis line cycles any firefox window (matched by \"firefox\" in the window title) OR if not found, launches a new firefox instance:\n\n```\n<Super>f,firefox,,\n```\n\nThis line cycles any open gnome-terminal (matched by `wm_class = Gnome-terminal`) OR if not found, launches a new one.\n\n```\n<Super>r,gnome-terminal,Gnome-terminal,\n```\n\nYou may use **regular expressions** in title or wm_class. Just put the expression between slashes.   \nE.g. to jump to pidgin conversation window you may use this line\n(that mean any windows of wm_class Pidgin, not containing the title Buddy List)\"\n\n```\n<Super>KP_1,pidgin,Pidgin,/^((?!Buddy List).)*$/\n```\n\n\n## Run only form\n\nSince it is very convenient to use a single file for all of your shortcuts (backup, migration to another system...), you can define standard shortcuts as well. These commands just get launched whenever the keys are hit.\n\nRun only form: `shortcut,command`\n\n### Examples:\n\nThis line will launch notify-send command.\n\n```\n<Super>h,notify-send Hello world\n```\n\n\nTips\n===\n* For the examples, see [shortcuts.default](shortcuts.default) file.\n* How to know wm_class? Alt+f2, lg, \"windows\" tab (at least on Ubuntu 17.10)\n* You may change the configuration file on the fly. Just disable & enable the extension, shortcuts load again from scratch.\n", 
  "name": "Run or raise", 
  "shell-version": [
    "3.26.1"
  ], 
  "url": "https://github.com/CZ-NIC/run-or-raise", 
  "uuid": "run-or-raise@edvard.cz", 
  "version": 2
}